src/cf/InformationRegisters/ДействияСПисьмами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияСПисьмами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовыйЯщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПочтовыеЯщикиУчетныхЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйПочтовыйЯщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПочтовыеЯщикиУчетныхЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПочтовыйЯщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПочтовыеЯщикиУчетныхЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСПисьмом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ДействияСПисьмом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияСПисьмом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВПочтовыйЯщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаФлага</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ДействияСПисьмами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЕстьПеремещенияПисем(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДействияСПисьмами.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.ДействияСПисьмами КАК ДействияСПисьмами
	|ГДЕ
	|	ДействияСПисьмами.УчетнаяЗапись = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Процедура ОчиститьПеремещениеПисем(УчетнаяЗапись) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДействияСПисьмами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчетнаяЗапись.Установить(УчетнаяЗапись);
	НаборЗаписей.Отбор.Действие.Установить(Перечисления.ДействияСПисьмом.ПеремещениеВПочтовыйЯщик);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ДанныеЗапросом(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияСПисьмами.Событие КАК Событие,
		|	ДействияСПисьмами.Действие КАК Действие,
		|	ДействияСПисьмами.ПочтовыйЯщик КАК ПочтовыйЯщик,
		|	ДействияСПисьмами.СтарыйПочтовыйЯщик КАК СтарыйПочтовыйЯщик,
		|	ДействияСПисьмами.НовыйПочтовыйЯщик КАК НовыйПочтовыйЯщик
		|ИЗ
		|	РегистрСведений.ДействияСПисьмами КАК ДействияСПисьмами
		|ГДЕ
		|	ДействияСПисьмами.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
